name: "ResNet-101"
layer {
  name: 'input-data'
  type: 'Python'
  top: 'data'
  top: 'im_info'
  top: 'gt_boxes'
  python_param {
    module: 'roi_data_layer.layer'
    layer: 'RoIDataLayer'
    param_str: "'num_classes': 2"
  }
}
layer {
  name: "conv1"
  bottom: "data"
  top: "conv1"
  type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 64
    kernel_size: 7
    pad: 3
    stride: 2
    weight_filler { type: "msra" std: 0.010 }
    bias_filler { type: "constant" value: 0 }
  }
}
layer {
  name: "bn_conv1"
  bottom: "conv1"
  top: "conv1"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: false
  }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
}
layer {
  name: "scale_conv1"
  bottom: "conv1"
  top: "conv1"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param { lr_mult: 1 }
}
layer {
  name: "conv1_relu"
  bottom: "conv1"
  top: "conv1"
  type: "ReLU"
}
layer {
  name: "pool1"
  bottom: "conv1"
  top: "pool1"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "res2a_branch2a"
  bottom: "pool1"
  top: "res2a_branch2a"
  type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 }
  convolution_param {
    num_output: 64
    kernel_size: 1
    pad: 0
    stride: 1
    bias_term: false
    weight_filler { type: "msra" std: 0.010 }
  }
}
layer {
  name: "bn2a_branch2a"
  bottom: "res2a_branch2a"
  top: "res2a_branch2a"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: false
  }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
}
layer {
  name: "scale2a_branch2a"
  bottom: "res2a_branch2a"
  top: "res2a_branch2a"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param { lr_mult: 1 }
}
layer {
  name: "res2a_branch2a_relu"
  bottom: "res2a_branch2a"
  top: "res2a_branch2a"
  type: "ReLU"
}
layer {
  name: "res2a_branch2b"
  bottom: "res2a_branch2a"
  top: "res2a_branch2b"
  type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 }
  convolution_param {
    num_output: 64
    kernel_size: 3
    pad: 1
    stride: 1
    bias_term: false
    weight_filler { type: "msra" std: 0.010 }
  }
}
layer {
  name: "bn2a_branch2b"
  bottom: "res2a_branch2b"
  top: "res2a_branch2b"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: false
  }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
}
layer {
  name: "scale2a_branch2b"
  bottom: "res2a_branch2b"
  top: "res2a_branch2b"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param { lr_mult: 1 }
}
layer {
  name: "res2a_branch2b_relu"
  bottom: "res2a_branch2b"
  top: "res2a_branch2b"
  type: "ReLU"
}
layer {
  name: "res2a_branch2c"
  bottom: "res2a_branch2b"
  top: "res2a_branch2c"
  type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 }
  convolution_param {
    num_output: 256
    kernel_size: 1
    pad: 0
    stride: 1
    bias_term: false
    weight_filler { type: "msra" std: 0.010 }
  }
}
layer {
  name: "bn2a_branch2c"
  bottom: "res2a_branch2c"
  top: "res2a_branch2c"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: false
  }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
}
layer {
  name: "scale2a_branch2c"
  bottom: "res2a_branch2c"
  top: "res2a_branch2c"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param { lr_mult: 1 }
}
layer {
  name: "res2a_branch1"
  bottom: "pool1"
  top: "res2a_branch1"
  type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 }
  convolution_param {
    num_output: 256
    kernel_size: 1
    pad: 0
    stride: 1
    bias_term: false
    weight_filler { type: "msra" std: 0.010 }
  }
}
layer {
  name: "bn2a_branch1"
  bottom: "res2a_branch1"
  top: "res2a_branch1"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: false
  }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
}
layer {
  name: "scale2a_branch1"
  bottom: "res2a_branch1"
  top: "res2a_branch1"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param { lr_mult: 1 }
}
layer {
	name: "res2a"
	bottom: "res2a_branch1"
	bottom: "res2a_branch2c"
	top: "res2a"
	type: "Eltwise"
}
layer {
  name: "res2a_relu"
  bottom: "res2a"
  top: "res2a"
  type: "ReLU"
}
layer {
  name: "res2b_branch2a"
  bottom: "res2a"
  top: "res2b_branch2a"
  type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 }
  convolution_param {
    num_output: 64
    kernel_size: 1
    pad: 0
    stride: 1
    bias_term: false
    weight_filler { type: "msra" std: 0.010 }
  }
}
layer {
  name: "bn2b_branch2a"
  bottom: "res2b_branch2a"
  top: "res2b_branch2a"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: false
  }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
}
layer {
  name: "scale2b_branch2a"
  bottom: "res2b_branch2a"
  top: "res2b_branch2a"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param { lr_mult: 1 }
}
layer {
  name: "res2b_branch2a_relu"
  bottom: "res2b_branch2a"
  top: "res2b_branch2a"
  type: "ReLU"
}
layer {
  name: "res2b_branch2b"
  bottom: "res2b_branch2a"
  top: "res2b_branch2b"
  type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 }
  convolution_param {
    num_output: 64
    kernel_size: 3
    pad: 1
    stride: 1
    bias_term: false
    weight_filler { type: "msra" std: 0.010 }
  }
}
layer {
  name: "bn2b_branch2b"
  bottom: "res2b_branch2b"
  top: "res2b_branch2b"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: false
  }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
}
layer {
  name: "scale2b_branch2b"
  bottom: "res2b_branch2b"
  top: "res2b_branch2b"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param { lr_mult: 1 }
}
layer {
  name: "res2b_branch2b_relu"
  bottom: "res2b_branch2b"
  top: "res2b_branch2b"
  type: "ReLU"
}
layer {
  name: "res2b_branch2c"
  bottom: "res2b_branch2b"
  top: "res2b_branch2c"
  type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 }
  convolution_param {
    num_output: 256
    kernel_size: 1
    pad: 0
    stride: 1
    bias_term: false
    weight_filler { type: "msra" std: 0.010 }
  }
}
layer {
  name: "bn2b_branch2c"
  bottom: "res2b_branch2c"
  top: "res2b_branch2c"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: false
  }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
}
layer {
  name: "scale2b_branch2c"
  bottom: "res2b_branch2c"
  top: "res2b_branch2c"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param { lr_mult: 1 }
}
layer {
	name: "res2b"
	bottom: "res2a"
	bottom: "res2b_branch2c"
	top: "res2b"
	type: "Eltwise"
}
layer {
  name: "res2b_relu"
  bottom: "res2b"
  top: "res2b"
  type: "ReLU"
}
layer {
  name: "res2c_branch2a"
  bottom: "res2b"
  top: "res2c_branch2a"
  type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 }
  convolution_param {
    num_output: 64
    kernel_size: 1
    pad: 0
    stride: 1
    bias_term: false
    weight_filler { type: "msra" std: 0.010 }
  }
}
layer {
  name: "bn2c_branch2a"
  bottom: "res2c_branch2a"
  top: "res2c_branch2a"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: false
  }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
}
layer {
  name: "scale2c_branch2a"
  bottom: "res2c_branch2a"
  top: "res2c_branch2a"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param { lr_mult: 1 }
}
layer {
  name: "res2c_branch2a_relu"
  bottom: "res2c_branch2a"
  top: "res2c_branch2a"
  type: "ReLU"
}
layer {
  name: "res2c_branch2b"
  bottom: "res2c_branch2a"
  top: "res2c_branch2b"
  type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 }
  convolution_param {
    num_output: 64
    kernel_size: 3
    pad: 1
    stride: 1
    bias_term: false
    weight_filler { type: "msra" std: 0.010 }
  }
}
layer {
  name: "bn2c_branch2b"
  bottom: "res2c_branch2b"
  top: "res2c_branch2b"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: false
  }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
}
layer {
  name: "scale2c_branch2b"
  bottom: "res2c_branch2b"
  top: "res2c_branch2b"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param { lr_mult: 1 }
}
layer {
  name: "res2c_branch2b_relu"
  bottom: "res2c_branch2b"
  top: "res2c_branch2b"
  type: "ReLU"
}
layer {
  name: "res2c_branch2c"
  bottom: "res2c_branch2b"
  top: "res2c_branch2c"
  type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 }
  convolution_param {
    num_output: 256
    kernel_size: 1
    pad: 0
    stride: 1
    bias_term: false
    weight_filler { type: "msra" std: 0.010 }
  }
}
layer {
  name: "bn2c_branch2c"
  bottom: "res2c_branch2c"
  top: "res2c_branch2c"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: false
  }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
}
layer {
  name: "scale2c_branch2c"
  bottom: "res2c_branch2c"
  top: "res2c_branch2c"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param { lr_mult: 1 }
}
layer {
	name: "res2c"
	bottom: "res2b"
	bottom: "res2c_branch2c"
	top: "res2c"
	type: "Eltwise"
}
layer {
  name: "res2c_relu"
  bottom: "res2c"
  top: "res2c"
  type: "ReLU"
}
layer {
  name: "res3a_branch2a"
  bottom: "res2c"
  top: "res3a_branch2a"
  type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 }
  convolution_param {
    num_output: 128
    kernel_size: 1
    pad: 0
    stride: 2
    bias_term: false
    weight_filler { type: "msra" std: 0.010 }
  }
}
layer {
  name: "bn3a_branch2a"
  bottom: "res3a_branch2a"
  top: "res3a_branch2a"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: false
  }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
}
layer {
  name: "scale3a_branch2a"
  bottom: "res3a_branch2a"
  top: "res3a_branch2a"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param { lr_mult: 1 }
}
layer {
  name: "res3a_branch2a_relu"
  bottom: "res3a_branch2a"
  top: "res3a_branch2a"
  type: "ReLU"
}
layer {
  name: "res3a_branch2b"
  bottom: "res3a_branch2a"
  top: "res3a_branch2b"
  type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 }
  convolution_param {
    num_output: 128
    kernel_size: 3
    pad: 1
    stride: 1
    bias_term: false
    weight_filler { type: "msra" std: 0.010 }
  }
}
layer {
  name: "bn3a_branch2b"
  bottom: "res3a_branch2b"
  top: "res3a_branch2b"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: false
  }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
}
layer {
  name: "scale3a_branch2b"
  bottom: "res3a_branch2b"
  top: "res3a_branch2b"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param { lr_mult: 1 }
}
layer {
  name: "res3a_branch2b_relu"
  bottom: "res3a_branch2b"
  top: "res3a_branch2b"
  type: "ReLU"
}
layer {
  name: "res3a_branch2c"
  bottom: "res3a_branch2b"
  top: "res3a_branch2c"
  type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 }
  convolution_param {
    num_output: 512
    kernel_size: 1
    pad: 0
    stride: 1
    bias_term: false
    weight_filler { type: "msra" std: 0.010 }
  }
}
layer {
  name: "bn3a_branch2c"
  bottom: "res3a_branch2c"
  top: "res3a_branch2c"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: false
  }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
}
layer {
  name: "scale3a_branch2c"
  bottom: "res3a_branch2c"
  top: "res3a_branch2c"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param { lr_mult: 1 }
}
layer {
  name: "res3a_branch1"
  bottom: "res2c"
  top: "res3a_branch1"
  type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 }
  convolution_param {
    num_output: 512
    kernel_size: 1
    pad: 0
    stride: 2
    bias_term: false
    weight_filler { type: "msra" std: 0.010 }
  }
}
layer {
  name: "bn3a_branch1"
  bottom: "res3a_branch1"
  top: "res3a_branch1"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: false
  }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
}
layer {
  name: "scale3a_branch1"
  bottom: "res3a_branch1"
  top: "res3a_branch1"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param { lr_mult: 1 }
}
layer {
	name: "res3a"
	bottom: "res3a_branch1"
	bottom: "res3a_branch2c"
	top: "res3a"
	type: "Eltwise"
}
layer {
  name: "res3a_relu"
  bottom: "res3a"
  top: "res3a"
  type: "ReLU"
}
layer {
  name: "res3b_branch2a"
  bottom: "res3a"
  top: "res3b_branch2a"
  type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 }
  convolution_param {
    num_output: 128
    kernel_size: 1
    pad: 0
    stride: 1
    bias_term: false
    weight_filler { type: "msra" std: 0.010 }
  }
}
layer {
  name: "bn3b_branch2a"
  bottom: "res3b_branch2a"
  top: "res3b_branch2a"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: false
  }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
}
layer {
  name: "scale3b_branch2a"
  bottom: "res3b_branch2a"
  top: "res3b_branch2a"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param { lr_mult: 1 }
}
layer {
  name: "res3b_branch2a_relu"
  bottom: "res3b_branch2a"
  top: "res3b_branch2a"
  type: "ReLU"
}
layer {
  name: "res3b_branch2b"
  bottom: "res3b_branch2a"
  top: "res3b_branch2b"
  type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 }
  convolution_param {
    num_output: 128
    kernel_size: 3
    pad: 1
    stride: 1
    bias_term: false
    weight_filler { type: "msra" std: 0.010 }
  }
}
layer {
  name: "bn3b_branch2b"
  bottom: "res3b_branch2b"
  top: "res3b_branch2b"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: false
  }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
}
layer {
  name: "scale3b_branch2b"
  bottom: "res3b_branch2b"
  top: "res3b_branch2b"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param { lr_mult: 1 }
}
layer {
  name: "res3b_branch2b_relu"
  bottom: "res3b_branch2b"
  top: "res3b_branch2b"
  type: "ReLU"
}
layer {
  name: "res3b_branch2c"
  bottom: "res3b_branch2b"
  top: "res3b_branch2c"
  type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 }
  convolution_param {
    num_output: 512
    kernel_size: 1
    pad: 0
    stride: 1
    bias_term: false
    weight_filler { type: "msra" std: 0.010 }
  }
}
layer {
  name: "bn3b_branch2c"
  bottom: "res3b_branch2c"
  top: "res3b_branch2c"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: false
  }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
}
layer {
  name: "scale3b_branch2c"
  bottom: "res3b_branch2c"
  top: "res3b_branch2c"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param { lr_mult: 1 }
}
layer {
	name: "res3b"
	bottom: "res3a"
	bottom: "res3b_branch2c"
	top: "res3b"
	type: "Eltwise"
}
layer {
  name: "res3b_relu"
  bottom: "res3b"
  top: "res3b"
  type: "ReLU"
}
layer {
  name: "res3c_branch2a"
  bottom: "res3b"
  top: "res3c_branch2a"
  type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 }
  convolution_param {
    num_output: 128
    kernel_size: 1
    pad: 0
    stride: 1
    bias_term: false
    weight_filler { type: "msra" std: 0.010 }
  }
}
layer {
  name: "bn3c_branch2a"
  bottom: "res3c_branch2a"
  top: "res3c_branch2a"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: false
  }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
}
layer {
  name: "scale3c_branch2a"
  bottom: "res3c_branch2a"
  top: "res3c_branch2a"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param { lr_mult: 1 }
}
layer {
  name: "res3c_branch2a_relu"
  bottom: "res3c_branch2a"
  top: "res3c_branch2a"
  type: "ReLU"
}
layer {
  name: "res3c_branch2b"
  bottom: "res3c_branch2a"
  top: "res3c_branch2b"
  type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 }
  convolution_param {
    num_output: 128
    kernel_size: 3
    pad: 1
    stride: 1
    bias_term: false
    weight_filler { type: "msra" std: 0.010 }
  }
}
layer {
  name: "bn3c_branch2b"
  bottom: "res3c_branch2b"
  top: "res3c_branch2b"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: false
  }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
}
layer {
  name: "scale3c_branch2b"
  bottom: "res3c_branch2b"
  top: "res3c_branch2b"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param { lr_mult: 1 }
}
layer {
  name: "res3c_branch2b_relu"
  bottom: "res3c_branch2b"
  top: "res3c_branch2b"
  type: "ReLU"
}
layer {
  name: "res3c_branch2c"
  bottom: "res3c_branch2b"
  top: "res3c_branch2c"
  type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 }
  convolution_param {
    num_output: 512
    kernel_size: 1
    pad: 0
    stride: 1
    bias_term: false
    weight_filler { type: "msra" std: 0.010 }
  }
}
layer {
  name: "bn3c_branch2c"
  bottom: "res3c_branch2c"
  top: "res3c_branch2c"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: false
  }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
}
layer {
  name: "scale3c_branch2c"
  bottom: "res3c_branch2c"
  top: "res3c_branch2c"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param { lr_mult: 1 }
}
layer {
	name: "res3c"
	bottom: "res3b"
	bottom: "res3c_branch2c"
	top: "res3c"
	type: "Eltwise"
}
layer {
  name: "res3c_relu"
  bottom: "res3c"
  top: "res3c"
  type: "ReLU"
}
layer {
  name: "res3d_branch2a"
  bottom: "res3c"
  top: "res3d_branch2a"
  type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 }
  convolution_param {
    num_output: 128
    kernel_size: 1
    pad: 0
    stride: 1
    bias_term: false
    weight_filler { type: "msra" std: 0.010 }
  }
}
layer {
  name: "bn3d_branch2a"
  bottom: "res3d_branch2a"
  top: "res3d_branch2a"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: false
  }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
}
layer {
  name: "scale3d_branch2a"
  bottom: "res3d_branch2a"
  top: "res3d_branch2a"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param { lr_mult: 1 }
}
layer {
  name: "res3d_branch2a_relu"
  bottom: "res3d_branch2a"
  top: "res3d_branch2a"
  type: "ReLU"
}
layer {
  name: "res3d_branch2b"
  bottom: "res3d_branch2a"
  top: "res3d_branch2b"
  type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 }
  convolution_param {
    num_output: 128
    kernel_size: 3
    pad: 1
    stride: 1
    bias_term: false
    weight_filler { type: "msra" std: 0.010 }
  }
}
layer {
  name: "bn3d_branch2b"
  bottom: "res3d_branch2b"
  top: "res3d_branch2b"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: false
  }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
}
layer {
  name: "scale3d_branch2b"
  bottom: "res3d_branch2b"
  top: "res3d_branch2b"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param { lr_mult: 1 }
}
layer {
  name: "res3d_branch2b_relu"
  bottom: "res3d_branch2b"
  top: "res3d_branch2b"
  type: "ReLU"
}
layer {
  name: "res3d_branch2c"
  bottom: "res3d_branch2b"
  top: "res3d_branch2c"
  type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 }
  convolution_param {
    num_output: 512
    kernel_size: 1
    pad: 0
    stride: 1
    bias_term: false
    weight_filler { type: "msra" std: 0.010 }
  }
}
layer {
  name: "bn3d_branch2c"
  bottom: "res3d_branch2c"
  top: "res3d_branch2c"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: false
  }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
}
layer {
  name: "scale3d_branch2c"
  bottom: "res3d_branch2c"
  top: "res3d_branch2c"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param { lr_mult: 1 }
}
layer {
	name: "res3d"
	bottom: "res3c"
	bottom: "res3d_branch2c"
	top: "res3d"
	type: "Eltwise"
}
layer {
  name: "res3d_relu"
  bottom: "res3d"
  top: "res3d"
  type: "ReLU"
}
layer {
  name: "res4a_branch2a"
  bottom: "res3d"
  top: "res4a_branch2a"
  type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 }
  convolution_param {
    num_output: 256
    kernel_size: 1
    pad: 0
    stride: 2
    bias_term: false
    weight_filler { type: "msra" std: 0.010 }
  }
}
layer {
  name: "bn4a_branch2a"
  bottom: "res4a_branch2a"
  top: "res4a_branch2a"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: false
  }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
}
layer {
  name: "scale4a_branch2a"
  bottom: "res4a_branch2a"
  top: "res4a_branch2a"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param { lr_mult: 1 }
}
layer {
  name: "res4a_branch2a_relu"
  bottom: "res4a_branch2a"
  top: "res4a_branch2a"
  type: "ReLU"
}
layer {
  name: "res4a_branch2b"
  bottom: "res4a_branch2a"
  top: "res4a_branch2b"
  type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 }
  convolution_param {
    num_output: 256
    kernel_size: 3
    pad: 1
    stride: 1
    bias_term: false
    weight_filler { type: "msra" std: 0.010 }
  }
}
layer {
  name: "bn4a_branch2b"
  bottom: "res4a_branch2b"
  top: "res4a_branch2b"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: false
  }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
}
layer {
  name: "scale4a_branch2b"
  bottom: "res4a_branch2b"
  top: "res4a_branch2b"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param { lr_mult: 1 }
}
layer {
  name: "res4a_branch2b_relu"
  bottom: "res4a_branch2b"
  top: "res4a_branch2b"
  type: "ReLU"
}
layer {
  name: "res4a_branch2c"
  bottom: "res4a_branch2b"
  top: "res4a_branch2c"
  type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 }
  convolution_param {
    num_output: 1024
    kernel_size: 1
    pad: 0
    stride: 1
    bias_term: false
    weight_filler { type: "msra" std: 0.010 }
  }
}
layer {
  name: "bn4a_branch2c"
  bottom: "res4a_branch2c"
  top: "res4a_branch2c"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: false
  }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
}
layer {
  name: "scale4a_branch2c"
  bottom: "res4a_branch2c"
  top: "res4a_branch2c"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param { lr_mult: 1 }
}
layer {
  name: "res4a_branch1"
  bottom: "res3d"
  top: "res4a_branch1"
  type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 }
  convolution_param {
    num_output: 1024
    kernel_size: 1
    pad: 0
    stride: 2
    bias_term: false
    weight_filler { type: "msra" std: 0.010 }
  }
}
layer {
  name: "bn4a_branch1"
  bottom: "res4a_branch1"
  top: "res4a_branch1"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: false
  }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
}
layer {
  name: "scale4a_branch1"
  bottom: "res4a_branch1"
  top: "res4a_branch1"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param { lr_mult: 1 }
}
layer {
	name: "res4a"
	bottom: "res4a_branch1"
	bottom: "res4a_branch2c"
	top: "res4a"
	type: "Eltwise"
}
layer {
  name: "res4a_relu"
  bottom: "res4a"
  top: "res4a"
  type: "ReLU"
}
layer {
  name: "res4b_branch2a"
  bottom: "res4a"
  top: "res4b_branch2a"
  type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 }
  convolution_param {
    num_output: 256
    kernel_size: 1
    pad: 0
    stride: 1
    bias_term: false
    weight_filler { type: "msra" std: 0.010 }
  }
}
layer {
  name: "bn4b_branch2a"
  bottom: "res4b_branch2a"
  top: "res4b_branch2a"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: false
  }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
}
layer {
  name: "scale4b_branch2a"
  bottom: "res4b_branch2a"
  top: "res4b_branch2a"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param { lr_mult: 1 }
}
layer {
  name: "res4b_branch2a_relu"
  bottom: "res4b_branch2a"
  top: "res4b_branch2a"
  type: "ReLU"
}
layer {
  name: "res4b_branch2b"
  bottom: "res4b_branch2a"
  top: "res4b_branch2b"
  type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 }
  convolution_param {
    num_output: 256
    kernel_size: 3
    pad: 1
    stride: 1
    bias_term: false
    weight_filler { type: "msra" std: 0.010 }
  }
}
layer {
  name: "bn4b_branch2b"
  bottom: "res4b_branch2b"
  top: "res4b_branch2b"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: false
  }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
}
layer {
  name: "scale4b_branch2b"
  bottom: "res4b_branch2b"
  top: "res4b_branch2b"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param { lr_mult: 1 }
}
layer {
  name: "res4b_branch2b_relu"
  bottom: "res4b_branch2b"
  top: "res4b_branch2b"
  type: "ReLU"
}
layer {
  name: "res4b_branch2c"
  bottom: "res4b_branch2b"
  top: "res4b_branch2c"
  type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 }
  convolution_param {
    num_output: 1024
    kernel_size: 1
    pad: 0
    stride: 1
    bias_term: false
    weight_filler { type: "msra" std: 0.010 }
  }
}
layer {
  name: "bn4b_branch2c"
  bottom: "res4b_branch2c"
  top: "res4b_branch2c"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: false
  }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
}
layer {
  name: "scale4b_branch2c"
  bottom: "res4b_branch2c"
  top: "res4b_branch2c"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param { lr_mult: 1 }
}
layer {
	name: "res4b"
	bottom: "res4a"
	bottom: "res4b_branch2c"
	top: "res4b"
	type: "Eltwise"
}
layer {
  name: "res4b_relu"
  bottom: "res4b"
  top: "res4b"
  type: "ReLU"
}
layer {
  name: "res4c_branch2a"
  bottom: "res4b"
  top: "res4c_branch2a"
  type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 }
  convolution_param {
    num_output: 256
    kernel_size: 1
    pad: 0
    stride: 1
    bias_term: false
    weight_filler { type: "msra" std: 0.010 }
  }
}
layer {
  name: "bn4c_branch2a"
  bottom: "res4c_branch2a"
  top: "res4c_branch2a"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: false
  }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
}
layer {
  name: "scale4c_branch2a"
  bottom: "res4c_branch2a"
  top: "res4c_branch2a"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param { lr_mult: 1 }
}
layer {
  name: "res4c_branch2a_relu"
  bottom: "res4c_branch2a"
  top: "res4c_branch2a"
  type: "ReLU"
}
layer {
  name: "res4c_branch2b"
  bottom: "res4c_branch2a"
  top: "res4c_branch2b"
  type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 }
  convolution_param {
    num_output: 256
    kernel_size: 3
    pad: 1
    stride: 1
    bias_term: false
    weight_filler { type: "msra" std: 0.010 }
  }
}
layer {
  name: "bn4c_branch2b"
  bottom: "res4c_branch2b"
  top: "res4c_branch2b"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: false
  }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
}
layer {
  name: "scale4c_branch2b"
  bottom: "res4c_branch2b"
  top: "res4c_branch2b"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param { lr_mult: 1 }
}
layer {
  name: "res4c_branch2b_relu"
  bottom: "res4c_branch2b"
  top: "res4c_branch2b"
  type: "ReLU"
}
layer {
  name: "res4c_branch2c"
  bottom: "res4c_branch2b"
  top: "res4c_branch2c"
  type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 }
  convolution_param {
    num_output: 1024
    kernel_size: 1
    pad: 0
    stride: 1
    bias_term: false
    weight_filler { type: "msra" std: 0.010 }
  }
}
layer {
  name: "bn4c_branch2c"
  bottom: "res4c_branch2c"
  top: "res4c_branch2c"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: false
  }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
}
layer {
  name: "scale4c_branch2c"
  bottom: "res4c_branch2c"
  top: "res4c_branch2c"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param { lr_mult: 1 }
}
layer {
	name: "res4c"
	bottom: "res4b"
	bottom: "res4c_branch2c"
	top: "res4c"
	type: "Eltwise"
}
layer {
  name: "res4c_relu"
  bottom: "res4c"
  top: "res4c"
  type: "ReLU"
}
layer {
  name: "res4d_branch2a"
  bottom: "res4c"
  top: "res4d_branch2a"
  type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 }
  convolution_param {
    num_output: 256
    kernel_size: 1
    pad: 0
    stride: 1
    bias_term: false
    weight_filler { type: "msra" std: 0.010 }
  }
}
layer {
  name: "bn4d_branch2a"
  bottom: "res4d_branch2a"
  top: "res4d_branch2a"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: false
  }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
}
layer {
  name: "scale4d_branch2a"
  bottom: "res4d_branch2a"
  top: "res4d_branch2a"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param { lr_mult: 1 }
}
layer {
  name: "res4d_branch2a_relu"
  bottom: "res4d_branch2a"
  top: "res4d_branch2a"
  type: "ReLU"
}
layer {
  name: "res4d_branch2b"
  bottom: "res4d_branch2a"
  top: "res4d_branch2b"
  type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 }
  convolution_param {
    num_output: 256
    kernel_size: 3
    pad: 1
    stride: 1
    bias_term: false
    weight_filler { type: "msra" std: 0.010 }
  }
}
layer {
  name: "bn4d_branch2b"
  bottom: "res4d_branch2b"
  top: "res4d_branch2b"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: false
  }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
}
layer {
  name: "scale4d_branch2b"
  bottom: "res4d_branch2b"
  top: "res4d_branch2b"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param { lr_mult: 1 }
}
layer {
  name: "res4d_branch2b_relu"
  bottom: "res4d_branch2b"
  top: "res4d_branch2b"
  type: "ReLU"
}
layer {
  name: "res4d_branch2c"
  bottom: "res4d_branch2b"
  top: "res4d_branch2c"
  type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 }
  convolution_param {
    num_output: 1024
    kernel_size: 1
    pad: 0
    stride: 1
    bias_term: false
    weight_filler { type: "msra" std: 0.010 }
  }
}
layer {
  name: "bn4d_branch2c"
  bottom: "res4d_branch2c"
  top: "res4d_branch2c"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: false
  }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
}
layer {
  name: "scale4d_branch2c"
  bottom: "res4d_branch2c"
  top: "res4d_branch2c"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param { lr_mult: 1 }
}
layer {
	name: "res4d"
	bottom: "res4c"
	bottom: "res4d_branch2c"
	top: "res4d"
	type: "Eltwise"
}
layer {
  name: "res4d_relu"
  bottom: "res4d"
  top: "res4d"
  type: "ReLU"
}
layer {
  name: "res4e_branch2a"
  bottom: "res4d"
  top: "res4e_branch2a"
  type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 }
  convolution_param {
    num_output: 256
    kernel_size: 1
    pad: 0
    stride: 1
    bias_term: false
    weight_filler { type: "msra" std: 0.010 }
  }
}
layer {
  name: "bn4e_branch2a"
  bottom: "res4e_branch2a"
  top: "res4e_branch2a"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: false
  }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
}
layer {
  name: "scale4e_branch2a"
  bottom: "res4e_branch2a"
  top: "res4e_branch2a"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param { lr_mult: 1 }
}
layer {
  name: "res4e_branch2a_relu"
  bottom: "res4e_branch2a"
  top: "res4e_branch2a"
  type: "ReLU"
}
layer {
  name: "res4e_branch2b"
  bottom: "res4e_branch2a"
  top: "res4e_branch2b"
  type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 }
  convolution_param {
    num_output: 256
    kernel_size: 3
    pad: 1
    stride: 1
    bias_term: false
    weight_filler { type: "msra" std: 0.010 }
  }
}
layer {
  name: "bn4e_branch2b"
  bottom: "res4e_branch2b"
  top: "res4e_branch2b"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: false
  }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
}
layer {
  name: "scale4e_branch2b"
  bottom: "res4e_branch2b"
  top: "res4e_branch2b"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param { lr_mult: 1 }
}
layer {
  name: "res4e_branch2b_relu"
  bottom: "res4e_branch2b"
  top: "res4e_branch2b"
  type: "ReLU"
}
layer {
  name: "res4e_branch2c"
  bottom: "res4e_branch2b"
  top: "res4e_branch2c"
  type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 }
  convolution_param {
    num_output: 1024
    kernel_size: 1
    pad: 0
    stride: 1
    bias_term: false
    weight_filler { type: "msra" std: 0.010 }
  }
}
layer {
  name: "bn4e_branch2c"
  bottom: "res4e_branch2c"
  top: "res4e_branch2c"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: false
  }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
}
layer {
  name: "scale4e_branch2c"
  bottom: "res4e_branch2c"
  top: "res4e_branch2c"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param { lr_mult: 1 }
}
layer {
	name: "res4e"
	bottom: "res4d"
	bottom: "res4e_branch2c"
	top: "res4e"
	type: "Eltwise"
}
layer {
  name: "res4e_relu"
  bottom: "res4e"
  top: "res4e"
  type: "ReLU"
}
layer {
  name: "res4f_branch2a"
  bottom: "res4e"
  top: "res4f_branch2a"
  type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 }
  convolution_param {
    num_output: 256
    kernel_size: 1
    pad: 0
    stride: 1
    bias_term: false
    weight_filler { type: "msra" std: 0.010 }
  }
}
layer {
  name: "bn4f_branch2a"
  bottom: "res4f_branch2a"
  top: "res4f_branch2a"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: false
  }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
}
layer {
  name: "scale4f_branch2a"
  bottom: "res4f_branch2a"
  top: "res4f_branch2a"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param { lr_mult: 1 }
}
layer {
  name: "res4f_branch2a_relu"
  bottom: "res4f_branch2a"
  top: "res4f_branch2a"
  type: "ReLU"
}
layer {
  name: "res4f_branch2b"
  bottom: "res4f_branch2a"
  top: "res4f_branch2b"
  type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 }
  convolution_param {
    num_output: 256
    kernel_size: 3
    pad: 1
    stride: 1
    bias_term: false
    weight_filler { type: "msra" std: 0.010 }
  }
}
layer {
  name: "bn4f_branch2b"
  bottom: "res4f_branch2b"
  top: "res4f_branch2b"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: false
  }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
}
layer {
  name: "scale4f_branch2b"
  bottom: "res4f_branch2b"
  top: "res4f_branch2b"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param { lr_mult: 1 }
}
layer {
  name: "res4f_branch2b_relu"
  bottom: "res4f_branch2b"
  top: "res4f_branch2b"
  type: "ReLU"
}
layer {
  name: "res4f_branch2c"
  bottom: "res4f_branch2b"
  top: "res4f_branch2c"
  type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 }
  convolution_param {
    num_output: 1024
    kernel_size: 1
    pad: 0
    stride: 1
    bias_term: false
    weight_filler { type: "msra" std: 0.010 }
  }
}
layer {
  name: "bn4f_branch2c"
  bottom: "res4f_branch2c"
  top: "res4f_branch2c"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: false
  }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
}
layer {
  name: "scale4f_branch2c"
  bottom: "res4f_branch2c"
  top: "res4f_branch2c"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param { lr_mult: 1 }
}
layer {
	name: "res4f"
	bottom: "res4e"
	bottom: "res4f_branch2c"
	top: "res4f"
	type: "Eltwise"
}
layer {
  name: "res4f_relu"
  bottom: "res4f"
  top: "res4f"
  type: "ReLU"
}
layer {
  name: "res4g_branch2a"
  bottom: "res4f"
  top: "res4g_branch2a"
  type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 }
  convolution_param {
    num_output: 256
    kernel_size: 1
    pad: 0
    stride: 1
    bias_term: false
    weight_filler { type: "msra" std: 0.010 }
  }
}
layer {
  name: "bn4g_branch2a"
  bottom: "res4g_branch2a"
  top: "res4g_branch2a"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: false
  }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
}
layer {
  name: "scale4g_branch2a"
  bottom: "res4g_branch2a"
  top: "res4g_branch2a"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param { lr_mult: 1 }
}
layer {
  name: "res4g_branch2a_relu"
  bottom: "res4g_branch2a"
  top: "res4g_branch2a"
  type: "ReLU"
}
layer {
  name: "res4g_branch2b"
  bottom: "res4g_branch2a"
  top: "res4g_branch2b"
  type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 }
  convolution_param {
    num_output: 256
    kernel_size: 3
    pad: 1
    stride: 1
    bias_term: false
    weight_filler { type: "msra" std: 0.010 }
  }
}
layer {
  name: "bn4g_branch2b"
  bottom: "res4g_branch2b"
  top: "res4g_branch2b"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: false
  }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
}
layer {
  name: "scale4g_branch2b"
  bottom: "res4g_branch2b"
  top: "res4g_branch2b"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param { lr_mult: 1 }
}
layer {
  name: "res4g_branch2b_relu"
  bottom: "res4g_branch2b"
  top: "res4g_branch2b"
  type: "ReLU"
}
layer {
  name: "res4g_branch2c"
  bottom: "res4g_branch2b"
  top: "res4g_branch2c"
  type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 }
  convolution_param {
    num_output: 1024
    kernel_size: 1
    pad: 0
    stride: 1
    bias_term: false
    weight_filler { type: "msra" std: 0.010 }
  }
}
layer {
  name: "bn4g_branch2c"
  bottom: "res4g_branch2c"
  top: "res4g_branch2c"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: false
  }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
}
layer {
  name: "scale4g_branch2c"
  bottom: "res4g_branch2c"
  top: "res4g_branch2c"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param { lr_mult: 1 }
}
layer {
	name: "res4g"
	bottom: "res4f"
	bottom: "res4g_branch2c"
	top: "res4g"
	type: "Eltwise"
}
layer {
  name: "res4g_relu"
  bottom: "res4g"
  top: "res4g"
  type: "ReLU"
}
layer {
  name: "res4h_branch2a"
  bottom: "res4g"
  top: "res4h_branch2a"
  type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 }
  convolution_param {
    num_output: 256
    kernel_size: 1
    pad: 0
    stride: 1
    bias_term: false
    weight_filler { type: "msra" std: 0.010 }
  }
}
layer {
  name: "bn4h_branch2a"
  bottom: "res4h_branch2a"
  top: "res4h_branch2a"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: false
  }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
}
layer {
  name: "scale4h_branch2a"
  bottom: "res4h_branch2a"
  top: "res4h_branch2a"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param { lr_mult: 1 }
}
layer {
  name: "res4h_branch2a_relu"
  bottom: "res4h_branch2a"
  top: "res4h_branch2a"
  type: "ReLU"
}
layer {
  name: "res4h_branch2b"
  bottom: "res4h_branch2a"
  top: "res4h_branch2b"
  type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 }
  convolution_param {
    num_output: 256
    kernel_size: 3
    pad: 1
    stride: 1
    bias_term: false
    weight_filler { type: "msra" std: 0.010 }
  }
}
layer {
  name: "bn4h_branch2b"
  bottom: "res4h_branch2b"
  top: "res4h_branch2b"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: false
  }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
}
layer {
  name: "scale4h_branch2b"
  bottom: "res4h_branch2b"
  top: "res4h_branch2b"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param { lr_mult: 1 }
}
layer {
  name: "res4h_branch2b_relu"
  bottom: "res4h_branch2b"
  top: "res4h_branch2b"
  type: "ReLU"
}
layer {
  name: "res4h_branch2c"
  bottom: "res4h_branch2b"
  top: "res4h_branch2c"
  type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 }
  convolution_param {
    num_output: 1024
    kernel_size: 1
    pad: 0
    stride: 1
    bias_term: false
    weight_filler { type: "msra" std: 0.010 }
  }
}
layer {
  name: "bn4h_branch2c"
  bottom: "res4h_branch2c"
  top: "res4h_branch2c"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: false
  }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
}
layer {
  name: "scale4h_branch2c"
  bottom: "res4h_branch2c"
  top: "res4h_branch2c"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param { lr_mult: 1 }
}
layer {
	name: "res4h"
	bottom: "res4g"
	bottom: "res4h_branch2c"
	top: "res4h"
	type: "Eltwise"
}
layer {
  name: "res4h_relu"
  bottom: "res4h"
  top: "res4h"
  type: "ReLU"
}
layer {
  name: "res4i_branch2a"
  bottom: "res4h"
  top: "res4i_branch2a"
  type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 }
  convolution_param {
    num_output: 256
    kernel_size: 1
    pad: 0
    stride: 1
    bias_term: false
    weight_filler { type: "msra" std: 0.010 }
  }
}
layer {
  name: "bn4i_branch2a"
  bottom: "res4i_branch2a"
  top: "res4i_branch2a"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: false
  }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
}
layer {
  name: "scale4i_branch2a"
  bottom: "res4i_branch2a"
  top: "res4i_branch2a"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param { lr_mult: 1 }
}
layer {
  name: "res4i_branch2a_relu"
  bottom: "res4i_branch2a"
  top: "res4i_branch2a"
  type: "ReLU"
}
layer {
  name: "res4i_branch2b"
  bottom: "res4i_branch2a"
  top: "res4i_branch2b"
  type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 }
  convolution_param {
    num_output: 256
    kernel_size: 3
    pad: 1
    stride: 1
    bias_term: false
    weight_filler { type: "msra" std: 0.010 }
  }
}
layer {
  name: "bn4i_branch2b"
  bottom: "res4i_branch2b"
  top: "res4i_branch2b"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: false
  }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
}
layer {
  name: "scale4i_branch2b"
  bottom: "res4i_branch2b"
  top: "res4i_branch2b"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param { lr_mult: 1 }
}
layer {
  name: "res4i_branch2b_relu"
  bottom: "res4i_branch2b"
  top: "res4i_branch2b"
  type: "ReLU"
}
layer {
  name: "res4i_branch2c"
  bottom: "res4i_branch2b"
  top: "res4i_branch2c"
  type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 }
  convolution_param {
    num_output: 1024
    kernel_size: 1
    pad: 0
    stride: 1
    bias_term: false
    weight_filler { type: "msra" std: 0.010 }
  }
}
layer {
  name: "bn4i_branch2c"
  bottom: "res4i_branch2c"
  top: "res4i_branch2c"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: false
  }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
}
layer {
  name: "scale4i_branch2c"
  bottom: "res4i_branch2c"
  top: "res4i_branch2c"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param { lr_mult: 1 }
}
layer {
	name: "res4i"
	bottom: "res4h"
	bottom: "res4i_branch2c"
	top: "res4i"
	type: "Eltwise"
}
layer {
  name: "res4i_relu"
  bottom: "res4i"
  top: "res4i"
  type: "ReLU"
}
layer {
  name: "res4j_branch2a"
  bottom: "res4i"
  top: "res4j_branch2a"
  type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 }
  convolution_param {
    num_output: 256
    kernel_size: 1
    pad: 0
    stride: 1
    bias_term: false
    weight_filler { type: "msra" std: 0.010 }
  }
}
layer {
  name: "bn4j_branch2a"
  bottom: "res4j_branch2a"
  top: "res4j_branch2a"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: false
  }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
}
layer {
  name: "scale4j_branch2a"
  bottom: "res4j_branch2a"
  top: "res4j_branch2a"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param { lr_mult: 1 }
}
layer {
  name: "res4j_branch2a_relu"
  bottom: "res4j_branch2a"
  top: "res4j_branch2a"
  type: "ReLU"
}
layer {
  name: "res4j_branch2b"
  bottom: "res4j_branch2a"
  top: "res4j_branch2b"
  type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 }
  convolution_param {
    num_output: 256
    kernel_size: 3
    pad: 1
    stride: 1
    bias_term: false
    weight_filler { type: "msra" std: 0.010 }
  }
}
layer {
  name: "bn4j_branch2b"
  bottom: "res4j_branch2b"
  top: "res4j_branch2b"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: false
  }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
}
layer {
  name: "scale4j_branch2b"
  bottom: "res4j_branch2b"
  top: "res4j_branch2b"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param { lr_mult: 1 }
}
layer {
  name: "res4j_branch2b_relu"
  bottom: "res4j_branch2b"
  top: "res4j_branch2b"
  type: "ReLU"
}
layer {
  name: "res4j_branch2c"
  bottom: "res4j_branch2b"
  top: "res4j_branch2c"
  type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 }
  convolution_param {
    num_output: 1024
    kernel_size: 1
    pad: 0
    stride: 1
    bias_term: false
    weight_filler { type: "msra" std: 0.010 }
  }
}
layer {
  name: "bn4j_branch2c"
  bottom: "res4j_branch2c"
  top: "res4j_branch2c"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: false
  }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
}
layer {
  name: "scale4j_branch2c"
  bottom: "res4j_branch2c"
  top: "res4j_branch2c"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param { lr_mult: 1 }
}
layer {
	name: "res4j"
	bottom: "res4i"
	bottom: "res4j_branch2c"
	top: "res4j"
	type: "Eltwise"
}
layer {
  name: "res4j_relu"
  bottom: "res4j"
  top: "res4j"
  type: "ReLU"
}
layer {
  name: "res4k_branch2a"
  bottom: "res4j"
  top: "res4k_branch2a"
  type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 }
  convolution_param {
    num_output: 256
    kernel_size: 1
    pad: 0
    stride: 1
    bias_term: false
    weight_filler { type: "msra" std: 0.010 }
  }
}
layer {
  name: "bn4k_branch2a"
  bottom: "res4k_branch2a"
  top: "res4k_branch2a"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: false
  }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
}
layer {
  name: "scale4k_branch2a"
  bottom: "res4k_branch2a"
  top: "res4k_branch2a"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param { lr_mult: 1 }
}
layer {
  name: "res4k_branch2a_relu"
  bottom: "res4k_branch2a"
  top: "res4k_branch2a"
  type: "ReLU"
}
layer {
  name: "res4k_branch2b"
  bottom: "res4k_branch2a"
  top: "res4k_branch2b"
  type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 }
  convolution_param {
    num_output: 256
    kernel_size: 3
    pad: 1
    stride: 1
    bias_term: false
    weight_filler { type: "msra" std: 0.010 }
  }
}
layer {
  name: "bn4k_branch2b"
  bottom: "res4k_branch2b"
  top: "res4k_branch2b"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: false
  }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
}
layer {
  name: "scale4k_branch2b"
  bottom: "res4k_branch2b"
  top: "res4k_branch2b"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param { lr_mult: 1 }
}
layer {
  name: "res4k_branch2b_relu"
  bottom: "res4k_branch2b"
  top: "res4k_branch2b"
  type: "ReLU"
}
layer {
  name: "res4k_branch2c"
  bottom: "res4k_branch2b"
  top: "res4k_branch2c"
  type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 }
  convolution_param {
    num_output: 1024
    kernel_size: 1
    pad: 0
    stride: 1
    bias_term: false
    weight_filler { type: "msra" std: 0.010 }
  }
}
layer {
  name: "bn4k_branch2c"
  bottom: "res4k_branch2c"
  top: "res4k_branch2c"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: false
  }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
}
layer {
  name: "scale4k_branch2c"
  bottom: "res4k_branch2c"
  top: "res4k_branch2c"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param { lr_mult: 1 }
}
layer {
	name: "res4k"
	bottom: "res4j"
	bottom: "res4k_branch2c"
	top: "res4k"
	type: "Eltwise"
}
layer {
  name: "res4k_relu"
  bottom: "res4k"
  top: "res4k"
  type: "ReLU"
}
layer {
  name: "res4l_branch2a"
  bottom: "res4k"
  top: "res4l_branch2a"
  type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 }
  convolution_param {
    num_output: 256
    kernel_size: 1
    pad: 0
    stride: 1
    bias_term: false
    weight_filler { type: "msra" std: 0.010 }
  }
}
layer {
  name: "bn4l_branch2a"
  bottom: "res4l_branch2a"
  top: "res4l_branch2a"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: false
  }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
}
layer {
  name: "scale4l_branch2a"
  bottom: "res4l_branch2a"
  top: "res4l_branch2a"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param { lr_mult: 1 }
}
layer {
  name: "res4l_branch2a_relu"
  bottom: "res4l_branch2a"
  top: "res4l_branch2a"
  type: "ReLU"
}
layer {
  name: "res4l_branch2b"
  bottom: "res4l_branch2a"
  top: "res4l_branch2b"
  type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 }
  convolution_param {
    num_output: 256
    kernel_size: 3
    pad: 1
    stride: 1
    bias_term: false
    weight_filler { type: "msra" std: 0.010 }
  }
}
layer {
  name: "bn4l_branch2b"
  bottom: "res4l_branch2b"
  top: "res4l_branch2b"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: false
  }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
}
layer {
  name: "scale4l_branch2b"
  bottom: "res4l_branch2b"
  top: "res4l_branch2b"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param { lr_mult: 1 }
}
layer {
  name: "res4l_branch2b_relu"
  bottom: "res4l_branch2b"
  top: "res4l_branch2b"
  type: "ReLU"
}
layer {
  name: "res4l_branch2c"
  bottom: "res4l_branch2b"
  top: "res4l_branch2c"
  type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 }
  convolution_param {
    num_output: 1024
    kernel_size: 1
    pad: 0
    stride: 1
    bias_term: false
    weight_filler { type: "msra" std: 0.010 }
  }
}
layer {
  name: "bn4l_branch2c"
  bottom: "res4l_branch2c"
  top: "res4l_branch2c"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: false
  }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
}
layer {
  name: "scale4l_branch2c"
  bottom: "res4l_branch2c"
  top: "res4l_branch2c"
  type: "Scale"
  scale_param {
    bias_term: true
  }
  param { lr_mult: 1 }
}
layer {
	name: "res4l"
	bottom: "res4k"
